#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "d957f662-6d14-48e2-b5fc-a8a9ef19000f"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "query-clients"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "d957f662-6d14-48e2-b5fc-a8a9ef19000f"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-clients"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/create-client"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "9eadfaba-8316-469b-972f-a4d1abea207f"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/manage-clients"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "3f9bad47-92c6-47d7-af91-315995c54fb1"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/query-clients"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "57a520a8-a640-4502-b3f3-4b0bd4b7a1f9"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["realm-management/view-clients"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "49c3e0d5-bec8-43a0-bab7-c8ddf91b2ce2"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/create-client"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "bafe798c-4703-452b-aad4-bc7ef8a48b70"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "create-client"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/manage-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "bafe798c-4703-452b-aad4-bc7ef8a48b70"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "manage-clients"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/query-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "bafe798c-4703-452b-aad4-bc7ef8a48b70"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "query-clients"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PNET-API-CLIENT-GENERATION.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-clients"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "bafe798c-4703-452b-aad4-bc7ef8a48b70"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-clients"
      + service_account_user_id = (known after apply)
    }

Plan: 22 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*